In [1]:
#current working directory
import os
os.getcwd()

'/Users/shouqmohammed/Downloads/task 2'

In [2]:
import pandas as pd

In [3]:
#load the Excel file which has extension of .xlsx
data = pd.read_excel("points-of-sale-transactions-mar-22.xlsx")

In [4]:
data.head()

   112    Main  Unnamed: 2 Unnamed: 3  Unnamed: 4  Unnamed: 5
0    5  $B$456         NaN    Refresh           0         NaN
1    5  $B$458         NaN    Refresh           0         NaN
2    5  $B$457         NaN    Refresh           0         NaN
3  7-3  $BE$49         NaN    Refresh           0         0.0
4  7-3  $BE$46         NaN    Refresh           0         0.0

In [5]:
data.tail()

     112    Main  Unnamed: 2 Unnamed: 3  Unnamed: 4  Unnamed: 5
107  7-3   $K$24         NaN    Refresh           0         0.0
108  7-3   $C$19         NaN    Refresh           0         0.0
109  7-3   $C$16         NaN    Refresh           0         0.0
110  7-3   $C$31         NaN    Refresh           0         0.0
111  7-3  $BE$15         NaN    Refresh           0         0.0